{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "hi",
                "hey",
                "how are you",
                "is anyone there?",
                "hello",
                "good day"
            ],
            "responses": [
                "Hey :-)",
                "Hello, thanks for visiting",
                "Hi there, what can I do for you?",
                "Hi there, how can I help?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "bye",
                "see you later",
                "goodbye"
            ],
            "responses": [
                "See you later, thanks for visiting",
                "Have a nice day",
                "Bye! Come back again soon."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "thanks",
                "thank you",
                "that's helpful",
                "thank's a lot!"
            ],
            "responses": [
                "Happy to help!",
                "Any time!",
                "My pleasure"
            ]
        },
        {
            "tag": "Departments",
            "patterns": [
                "what are the departments available in rvrjc","various departments","what are the branches available in college","branches"
            ],
            "responses": [
                "The college has these departments in UG Computer Science of Engineering(CSE),Civil Engineering(CE),Chemical Engineering(CHE),Computer Science and Business System(TCS),Computer Science of Engineering(DS)Computer Science of Engineering(AI & ML),Computer Science of Engineering(IOT),Electronics and Communication Engineering(ECE),Electrical and Electronics Engineering(EEE),Information Technology(IT),Mechanical Engineering(MEC)  and MCA ,MBA under PG"
            ]

        },
        {
            "tag": "Contact Information",
            "patterns": [
                "where is rvrjc located?",
                "what are the contact numbers ?",
                "how we can contact with college ?","how can we contact the college ?"
            ],
            "responses": [
                "The college address is :R.V.R. & J.C.College of Engineering,Chandramoulipuram,Chowdavaram,GUNTUR-522 019 Andhra Pradesh India",
                "Contact us through Ph: 94910 73317 & 94910 73318 (Fax: 0863 - 2350343",
                "Mail us through College E-mail: rvrjcce@hotmail.com Principal E-mail: principal@rvrjc.ac.in"
            ],
            "links": ["https://rvrjcce.ac.in/contactus.php"]

        },
        {
            "tag": "Hostel Facility",
            "patterns": [
                "where is rvrjc  girls or womens or boys or mens hostel located?",
                "how we can contact with college hostel ?","about hostel","hostel","what about hostel facility"
            ],
            "responses": [
                "The College Provides Hostel Facility for Both men and women ,THe womens Hostel is located at R.V.R. & J.C.CoE City Office,Opposite Chinmaya Vidyalaya,S.V.N. Colony,GUNTUR-522 006Andhra PradesIndia",
                "The Boys Hostel is located near to the college itself  and is within a walkable distance from the college itself .The Girls is located in guntur town and transportation is also provided by the college itself."
            ],
            "links": ["https://rvrjcce.ac.in/menshostel.php?menu=faclt"]
        },
        {
            "tag": "RVRJC_History",
            "patterns": [
                "tell about rvrjc history?","what more about rvrjc","tell me about rvrjc","rvr","rvrjc","rvrjcce"
            ],
            "responses": [
                "Established by the renowned Nagarjuna Education Society (1967) in the year 1985, the College drew its initial impetus from people's representatives, local doctors, charitable trusts and commercial houses of Guntur District."
            ],
            "links": ["https://rvrjcce.ac.in/rvrjchistory.php"]
        },
        {
            "tag": "About RVRJC",
            "patterns": [
                "what is the mision of rvrjc","mission","aim"
            ],
            "responses": [
                "To produce globally agile graduates with value orientation, professional competency, critical and creative thinking and lifelong learning",
                "To enrich the society through education and research by generating proficient manpower, capable of contributing to the needs of the industry.",
                "To provide conducive learning environment, encompassing knowledge, communication and soft skills that enables the students to transform themselves into global leaders."
            ],
            "links": ["https://rvrjcce.ac.in/"]
        },
        {
            "tag": "Vision of RVRJC",
            "patterns": [
                "what is the vision of rvrjc","what is the vision of rvr"
            ],
            "responses": [
                "Established by the renowned Nagarjuna Education Society (1967) in the year 1985, the College drew its initial impetus from people's representatives, local doctors, charitable trusts and commercial houses of Guntur District."
            ],
            "links": ["https://rvrjcce.ac.in/missionvision.php"]
        },
        {
            "tag": "Accrediation",
            "patterns": [
                "what about rvrjc accrediation & affiliation","accredation","affeliation","whom is the college affiliated?","what about accrediation & affiliation of the college?"
            ],
            "responses": [
                "R.V.R. & J.C. College of Engineering is affiliated to AcharyaNagarjuna University (ANU), Nagarjuna Nagar, Guntur since it's inception. It is one among the pioneering institute affiliated to AcharyaNagarjuna University (ANU).The institute applied for accreditation by NAAC in the year 2012 and got A grade in 2014. The institute applied for renewal of accreditation by NAAC in 2019 and got NACC A+ grade in 2021.The college applied for ISO 9001:2015 Certifications and was granted in 2019 from 26.07.2019 to 25.07.2021."
            ],
            "links": ["https://rvrjcce.ac.in/accreditation.php"]
        },
        {
            "tag": "Ranking and Recognition",
            "patterns": [
                "what is the about rvrjc ranking and recognition","in what rank is rvrjc at currently in the state","whats the rank in national college's list","ranking of rvr"
            ],
            "responses": [
                " R.V.R. & J.C. College of Engineering is recognized both in India and abroad for its academic excellence. Over the past 36 years, the college has made significant contributions to the society both directly and through the efforts of it's distinguished Alumni. The A.P. State Council of Higher Education (APSCHE) awarded the second best rating to the institute in 'Academic Audit and Grading in the year 2004. The College has been consistently bagging the Best Performing U.G. College Award in the University Examinations under Acharya Nagarjuna University for the last eight years. The College also figures in the Top-100 Engineering Colleges in India according to the latest Outlook survey. The institute is under NIRF rank band 201  250(for 2020) and ISO 9001:2015 certification from 2019.  "
            ],
            "links": ["https://rvrjcce.ac.in/ranking.php"]
        },
        {
            "tag": "Principal",
            "patterns": [
                "tell about principal of rvrjc?","who is the principal of college","who is the principal of rvrjc","princi"
            ],
            "responses": [
                "Rayapati Venkata Ranga Rao & Jagarlamudi Chandramouli College of Engineering (RVR & JCCE) is the dream of an inspired group of eminent intellectuals and resourceful business leaders of Andhra Pradesh, to impart quality Technical Education to young men and women. Established in the year 1985 under the sponsorship of Nagarjuna Education Society, RVR & JCCE runs with AICTE, New Delhi, approved under Acharya Nagarjuna University, Guntur affiliation. During the 36 years of its quality sustenance, the institute has grown into one of the largest and leading engineering colleges in South India with excellent infrastructural facilities and competent human resources. Today it offers 11 B.Tech Degree courses, 6 M.Tech Degree courses in addition to MBA & MCA courses. All the eligible B.Tech Degree courses have been accredited six times by the National Board of Accreditation. The college has created an environment of academic stability coupled with the requisite flexibility,to meet the challenges of a changing world.The current Principal of college is Dr.K.Srinivasa Rao"
            ],
            "links": ["https://rvrjcce.ac.in/principal.php"]
        },
        {
            "tag": "Vice_president",
            "patterns": [
                "who is the vice-president of rvrjc","vice president","vice-president"
            ],
            "responses": [
                "Dr. K.Ravindra Director Academics, R&D Dr. N.V.Srinivasa Rao ,Director Finance & Administration,deanacademics@rvrjc.ac.in drkr@rvrjc.ac.in"
            ],
            "links": ["https://rvrjcce.ac.in/directorregs.php"]
        },
        {
            "tag": "Finanace_Administration_RVRJC",
            "patterns": [
                "who is the finance& administration of rvrjc","who takes care of finance and administration of the college","finance and adminisrtation"
            ],
            "responses": [
                "Dr. N.V.Srinivasa Rao,Director - Finance & Administration,registrar@rvrjc.ac.in ,narne_081986@yahoo.com"
            ]
        },
        {
            "tag": "Managment",
            "patterns": [
                "tell about nagarjuna education society(nes)","what about nes","nes"
            ],
            "responses": [
                "The Nagarjuna Education Society (Regd.), Guntur, was established and registered in 1967 by Philanthropists, Medical Doctors, Industrial and Commercial houses and the elite of Guntur with a mission of serving the Society through promotion of Education, Literature and Culture.The Nagarjuna Education Society(NES) had taken its birth with the social objective of providing educational opportunities to the rural youth who had been migrating to the towns in pursuit of education. The concept gained momentum and the Nagarjuna Education Society was established and Registered on 27th December, 1967 (No. 56 of 1967) under Societies Act  XXI of 1860 "
            ],
            "links": ["https://rvrjcce.ac.in/aboutnes.php"]
        },
        {
            "tag": "Founders",
            "patterns": [
                "who is the founders of rvrjc","founders","what about the forunders of rvrjcce","founders of rvr","who are the founders of rvr","rvr founders"
            ],
            "responses": [
                "1.Late Jagarlamudi Chandramouli (1914-1987)",
                "2.Late Dr. K. Sadasiva Rao ",
                "3.3. Dr. K. Basavapunnaiah - Dr. K. Basavapunnaiah GaruA Founder Member & the present President of Nagarjuna Education Society is a highly respected Physician, associated with Nagarjuna Education Society since its inception in various capacities as Vice-President,",
                "44. Dr. M. Gopalkrishna - Dr. M. Gopala Krishana GaruA Founder Member and the present Secretary of Nagarjuna Education Society and Secretary & Correspondent of R.V.R. & J.C.College of Engineering, Guntur the biggest institute sponsored by Nagarjuna Education Society and was established in the year 1985."
            ]
        },
        {
            "tag": "Campus Life",
            "patterns": [
                "what are the students activities in campus","campus life","campus life of students"
            ],
            "responses": [
                "Some of the student Activities are Music Club,PhotoGraphy Club,NSS & Blood Donors Club,Renewarable Energy Club,etc.."
            ],
            "links": ["https://rvrjcce.ac.in/studentsactivities.php"]
        },
        {
            "tag": "Fee_structure_college",
            "patterns": [
                "fee structure of btech ?","fee structure of b.tech","btech fees","b.tech fees","btech first year fee","b.tech first year fee"
            ],
            "responses": [
                "B.Tech. Tuition Fee per annum varies Depending upon the Branch for B.Tech and also offers various courses such as M.Tech and MCA "
            ],
            "links": ["https://rvrjcce.ac.in/fee.php"]
        },
        {
            "tag": "Fee_Structure_MTECH",
            "patterns": [
                "fee structure of m.tech","fee structure of mtech","mtech fee","m.tech fees","m.tech first year fee"
            ],
            "responses": [
                "M.tech. Tuition Fee per annum: Rs.40,000/-"
            ],
            "links": ["https://rvrjcce.ac.in/fee.php"]
        },
        {
            "tag": "Fee_structure_MCA",
            "patterns": [
                "fee structure of mca","mca fee","fee of mca first year"
            ],
            "responses": [
                "MCA. Tuition Fee per annum: Rs.38400/-"
            ],
            "links": ["https://rvrjcce.ac.in/fee.php"]
        },
        {
            "tag": "Process_of_Admission",
            "patterns": [
                "what is the admission procedure","admission process","how to get admission into rvrjc","how to get admitted into the college"
            ],
            "responses": [
                "Admissions are made as per the rules and regulations of Government of Andhra Pradesh. Government conducts Centralized admissions through theConvener, EAMCET on Rank basis for 70% and the remaining 30% is filled under BCategory seats by the College as per the directions of the government on Rank /Merit Order basis. All the seats shall be ratified by the Government. Minimumqualification is 10+2 with MPC or equivalent. 10% Lateral Entry seats in second yearare filled by the Convener, ECET, Government of Andhra Pradesh on Merit Rankbasis. Statutory Reservations are followed as per government directions."
            ],
            "links": ["https://rvrjcce.ac.in/admissionProcedure.php?menu=col"]
        },
        {
            "tag": "Infrastructure of the college",
            "patterns": [
                "what is the infrastructure of rvrjc","features of the college","infrastructre abilities that the students can experience","infrastructure"
            ],
            "responses": [
                "The college features state-of-the-art laboratories equipped with cutting-edge technology, including facilities for English language communication skills and e-learning. Every lecture hall and classroom is equipped with Wi-Fi and LCD screens for interactive learning. With 94 classrooms, 79 laboratories, and 10 drawing rooms, the college provides ample space for academic activities.",
                "The library, housed in a separate five-story building covering 1600 square meters, is well-stocked with a vast collection of books, journals, and electronic resources, catering to the academic needs of the students and faculty.",
                "RVRJCCE Guntur, or R. V. R. and J. C. College of Engineering in Guntur, boasts a picturesque campus with well-designed internal roadways lined with trees, creating a park-like ambiance. The college spans a built-up area of 92161 square meters and is known for its advanced infrastructure."
            ]
        },
        {
            "tag": "library_and_resources",
            "patterns": [
                "what library and resources do you offer?",
                "how can i access academic resources?","tell me about the college library","Does the college have a library","Library availability timings"

            ],
            "responses": [
                "Our library offers a vast collection of books, journals, digital resources, and study spaces. Additionally, we provide online databases, research tools, and academic support services to assist students with their studies."
            ],
            "links": ["https://rvrjcce.ac.in/library.php?menu=faclt"]
        },
        {
            "tag": "Fee_Structure_MBA",
            "patterns": [
                "fee structure of mba","mba fee","mba first year fees","mba fees"
            ],
            "responses": [
                "B.Tech. Tuition Fee per annum: Rs.52,900/-"
            ],
            "links": ["https://rvrjcce.ac.in/fee.php"]
        },
        {
            "tag": "Details_seminar_halls",
            "patterns": [
                "explain about seminar halls",
                "are there any seminar halls?",
                "how many seminar halls are there in the college?","does the college have any seminar halls ?"

            ],
            "responses": [
                "Cyber Block Seminar Hall -275 ,Decennial Block Seminar Hall-150,Digital Block Seminar Hall-175,Silver Jubilee Block Seminar Hall-400.Rama Rayudu Auditorium-900,Auditorium-700,Hi-Tech Block Seminar Hall-150,Open Air Theatre-2000"
            ]
        },
        {
            "tag": "Canteen",
            "patterns": [
                "tell about college canteen",
                "does the college have any store or canteen available?",
                "where can the students buy or eat food"
            ],
            "responses": [
                "College has spacious canteen facility in the college premises and is run by college management. A variety of South Indian food and snack items are provided to the students and staff of the college at highly subsidized rates with highest quality. Canteen has a big kitchen with steam cooking facility and the kitchen staff take extra care to provide the students and staff with nutritious and hygienic food in the campus canteen.Canteen is open from 8:00 AM to 4:45 PM on all working days.",
                "All stationary items are made available in the stores at reasonable rates, fixed by the college management. It also provides light refreshment like packed snack items, cakes, veg. puff, beverages etc to the students and staff of the college."
            ]
        },
        {
            "tag": "canteen_others",
            "patterns": [
                "what dining options are available on campus?",
                "is there a canteen?",
                "are there any recreational facilities like a gymnasium?"
            ],
            "responses": [
                "We offer a highly subsidized canteen serving lunch and snacks to cater to the culinary needs of students and staff. Additionally, we have a gymnasium to promote fitness and well-being among the campus community."
            ],
            "links": ["https://rvrjcce.ac.in/canteen.php?menu=faclt"]
        },
        {
            "tag": "Placement_Cell",
            "patterns": [
                "placements","tp and c","training and placement cell","what about training and placement cell","training & placement cell"
            ],
            "responses": [
                "The Cell was established with a prime objective of creating career opportunities in reputed corporates towards meeting aspirations of all the stakeholders. The Cell is devoted to cater to the needs of the organizations in conducting campus interviews for placements. Interactions with organizations are regularly done for placement requirements. Placement cell also conducts career guidance workshops to the final and pre-final year students to face their future with confidence. The cell is utilizing the facilities of the college like conference halls equipped with home theatres, LCD projector, PA system, laptops, desktops, laser printers, handy cam, digital camera, etc.",
                "To conduct training programmes, both in-house and out sourcing corporate trainers.Plan and organise more Industry - Institute Interactions for the benefit of students and the faculty.Introducing Video-Conference with Industry experts and RVR & JC Alumni (to create awareness for campus to corporate transformation) for career orientation and career exploration.To build RVR & JC brand value in the corporate world."
            ],
            "links": ["https://rvrjcce.ac.in/tp_about.php?menu=plcmnt"]
        },
        {
            "tag": "Examination",
            "patterns": [
                "what are the instructions to the students in the examinations",
                "exam cell","examination cell","what about exam cell?","tell me about exam cell"
            ],
            "responses": [
                "Once candidate enters the examination hall they are governed by the examination rules and will not be permitted to leave the examination hall till the end of the time specified there for.Candidates are advised to present in the Examination Hall half an hour before the commencement of examination.Candidates are prohibited from writing register number (except in front page) or name on any part of the answer booklet.Candidates should carry hall ticket and Photo ID Card to the examination hall."
            ],
            "links": ["https://rvrjcce.ac.in/examcell/"]
        },
        {
            "tag": "Chemical Engineering",
            "patterns": [
                "what is the vision of chemical engineering","about chemical engineering","chemical engineering"
            ],
            "responses": [
                "Establish a centre of academic excellence in the field of Chemical Engineering with a competing potential for training professionals and meet the requirements of industry and society.",
                "Equip students with the ability to inquire and investigate the problems associated with the field of Chemical Engineering and find continual, viable solutions",
                "To develop a centre of academic excellence in the field of Chemical Engineering, capable of training chemical engineering professionals to cater the needs of the industry and society.",
                "Empower students to apply the principles of Chemical Engineering in different allied fields and inculcate a multi-disciplinary approach to tackle nagging social issues in the context of environment and health."
            ],
            "links": ["http://che.rvrjcce.ac.in/"]
        },
        {
            "tag": "CSE(Data Science)",
            "patterns": [
                "tell department about cse(data science)","when was the branch established","data science","csd","cse data science","cse(data science)"
            ],
            "responses": [
                "Computer Science & Engineering (Data Science) department came into existence from the academic year 2021-22. Salient features of the department are as follow:",
                "Architecture and curriculum has been designed by a team of experienced faculty, data scientists and industry subject matter experts",
                "Through collaborations, internships, classroom teaching, and hands-on experience, students shall immerse themselves in the fields of technology, business, and communications and build a comprehensive skill set in Data Science.",
                "Core competencies in multiple areas - Programming, Mathematics, Statistics, Data Analytics, Artificial Intelligence, Machine Learning, Internet of Things, Data Wrangling, Data Visualization, Communication, Business Foundations, and Ethics will increase employability in the fast-paced Data Science industry.",
                "The department has well established laboratories, resourceful faculty and staff. It is noteworthy that the faculty are well versed in both teaching and research."
            ],
            "links": ["http://csd.rvrjcce.ac.in/"]

        },
        {
            "tag": "CSE(AI & ML)",
            "patterns": [
                "tell department about cse(ai & ml)","when was the branch established ?","csm","ai and ml","cse (ai & ml)","cse(ai and ml)","artificial intelligence and machine learning","artificial intelligence & machine learning"
            ],
            "responses": [
                "Artificial Intelligence (AI) is a technology which enables a machine to simulate human behaviour. Machine Learning (ML) a subset of AI which allows a machine to automatically learn from past data without programming explicitly. ML algorithms are used in a wide variety of applications, such as email filtering and computer vision, where it is difficult or infeasible to develop conventional algorithms to perform the needed tasks.",
                "RVR & JC College of Engineering offers a 4-year Under Graduate B. Tech., CSE (AI & ML) programme with the intake of 60 seats with the academic year 2021-2022 and increased intake of 180 seats from the academic year 2022-23.",
                "Graduates of B.Tech., in CSE (AI & ML) will acquire Computer Science & Engineering skills with an added expertise in Artificial Intelligence and Machine Learning algorithms to work across many domains, including medicine, finance, robotics, and business intelligence."
            ],
            "links": ["http://csm.rvrjcce.ac.in/"]
        },
        {
            "tag": "CSE(IOT)",
            "patterns": [
                "tell department about cse(iot)","internet of things","cso","cse(internet of things)"
            ],
            "responses": [
                "Internet of Things (IoT) is among the latest innovations in the area of Computer Science & Engineering and IT. This specialization covers the development of IoT products and services along with the devices for sensing, actuating, processing and inter communication. The program aims to train the students and develop within them strong theoretical foundation, systematic professional knowledge and strong practical skills in the fields of web-technologies, real time embedded systems, communications protocols and collaborative intelligence."
            ],
            "links": ["http://cso.rvrjcce.ac.in/"]
        },
        {
            "tag": "ECE",
            "patterns": [
                "tell department about ece","electronics communications and engineering","ece"
            ],
            "responses": [
                "The department of Electronics & Communication Engineering came into existence in 1985 immediately when the institute was founded. It was started with an intake of 40 students which was subsequently raised to 180 over a period of time. It offers 4- year B.Tech degree programme in Electronics & Communication Engineering."
            ],
            "links": ["http://ece.rvrjcce.ac.in/"]
        },
        {
            "tag": "programs",
            "patterns": [
                "what programs does your college offer?",
                "which courses can i study?","what are the branches and degree's offered in the college","branches"
            ],
            "responses": [
                "We offer a wide range of undergraduate and graduate programs in various fields such as engineering, business, sciences, and more. You can visit our website for a detailed list of programs."
            ],
            "links": ["https://rvrjcce.ac.in/courses.php"]
        },
        {
            "tag": "admission_requirements",
            "patterns": [
                "what are the admission requirements?",
                "how can i apply?","eligibility criteria","eligibility","how can i join the college","how can i join rvr"
            ],
            "responses": [
                "Admission requirements vary depending on the program you're interested in. Generally, we require high school transcripts, standardized test scores, letters of recommendation, and a personal statement. Please check our admissions page for specific requirements."
            ],
            "links": ["https://rvrjcce.ac.in/admissionProcedure.php?menu=col"]
        },
        {
            "tag": "tuition_fee",
            "patterns": [
                "how much is the tuition fee?",
                "what are the costs involved?","tuition-fee","tuition fees","tuition fee"
            ],
            "responses": [
                "Tuition fees vary by program and residency status. Please visit our tuition and fees page or contact our admissions office for detailed information on tuition costs."
            ],
            "links": ["https://rvrjcce.ac.in/fee.php"]
        },
        {
            "tag": "financial_aid",
            "patterns": [
                "do you offer scholarships or financial aid?",
                "how can i get financial assistance?","scholarships","scholarship","can i get any scholarship","state scholarship","central scholarship"
            ],
            "responses": [
                "Yes, we offer scholarships, grants, and financial aid to eligible students. You can find more information on our financial aid page or contact our financial aid office for assistance."
            ],
            "links": ["https://rvrjcce.ac.in/scholarship.php"]
        },
        {
            "tag": "campus_life",
            "patterns": [
                "what is the campus life like?",
                "how is the student community?","how is the campus life?","campus life","campus-life"
            ],
            "responses": [
                "Our campus offers a vibrant and diverse community with various student organizations, clubs, and events. We also have state-of-the-art facilities, housing options, and dining services to enhance your college experience."
            ]
        },
        {
            "tag": "campus_tour",
            "patterns": [
                "can i schedule a campus tour?",
                "how can i visit the campus?"
            ],
            "responses": [
                "Absolutely! We offer campus tours regularly. You can schedule a tour through our website or contact our admissions office to arrange a visit."
            ],
            "links": ["https://rvrjcce.ac.in/campusmap.php"]
        },
        {
            "tag": "job_placement",
            "patterns": [
                "what are the job placement rates for graduates?",
                "how successful are your alumni?","what is the placement rate"
            ],
            "responses": [
                "Our graduates have a high job placement rate in their respective fields. Many of our programs also offer internship opportunities to help students gain real-world experience and network with industry professionals."
            ]
        },
        {
            "tag": "placement cell overview",
            "patterns": [
                "can you tell me about the college's placement cell?",
                "what does the placement cell do?",
                "how does the placement cell assist students?"
            ],
            "responses": [
                "The placement cell is dedicated to creating career opportunities by organizing campus interviews, conducting career guidance workshops, and facilitating interactions with organizations for placement requirements. It utilizes various facilities of the college for these activities."
            ],
            "links":[""]
        },
        {
            "tag": "placement objectives",
            "patterns": [
                "what are the objectives of the placement cell?",
                "what goals does the placement cell aim to achieve?",
                "how does the placement cell plan to help students?"
            ],
            "responses": [
                "The placement cell aims to achieve 100% placements, invite top companies for campus recruitments, make students industry-ready, promote career counseling through guest lectures and seminars, and organize training programs. It also plans to conduct more industry-institute interactions and introduce video conferences with industry experts."
            ],
            "links": ["https://rvrjcce.ac.in/TandP-committee.php?menu=plcmnt"]
        },
        {
            "tag": "career guidance",
            "patterns": [
                "does the placement cell offer career guidance?",
                "how does the placement cell assist with career planning?",
                "are there workshops or seminars on career guidance?"
            ],
            "responses": [
                "Yes, the placement cell conducts career guidance workshops for final and pre-final year students to help them face their future with confidence. These workshops cover various aspects of career planning and preparation."
            ]
        },
        {
            "tag": "industry interactions",
            "patterns": [
                "are there opportunities for industry interactions?",
                "how often does the college organize interactions with industries?",
                "do you invite guest speakers from industries?"
            ],
            "responses": [
                "The placement cell plans and organizes industry-institute interactions to benefit students and faculty. It also invites guest speakers from various industries for guest lectures, awareness programs, and seminars to provide insights into the corporate world."
            ]
        },
        {
            "tag": "placement contact info",
            "patterns": [
                "how can i contact the placement cell?",
                "who should i reach out to for placement inquiries?",
                "what is the contact information for the placement cell?"
            ],
            "responses": [
                "You can contact the placement cell through the provided contact details. The SPoC is Ch.Srinivasa Rao, and the Alternate is V.Jagadeesh Kumar. You can reach out via email or mobile for placement inquiries and assistance."
            ]
        },
        {
            "tag": "placement success",
            "patterns": [
                "how successful is the placement cell?",
                "what is the placement record of the college?",
                "do many students get placed through campus interviews?"
            ],
            "responses": [
                "The placement cell strives for 100% placements and works diligently to invite the best companies for campus recruitments. With regular interactions with organizations and career guidance initiatives, the placement cell has a successful track record in helping students secure placements."
            ],
            "links": ["https://rvrjcce.ac.in/placement_statistics.php?menu=plcmnt"]
        },
        {
            "tag": "training programs",
            "patterns": [
                "are there any training programs offered by the placement cell?",
                "how does the placement cell prepare students for placements?",
                "what kind of training is provided?","How is the crt arranged to students","crt","crt programm ","crt institute"
            ],
            "responses": [
                "The placement cell conducts both in-house and outsourced training programs to prepare students for placements. These programs focus on enhancing students' skills, knowledge, and confidence to make them industry-ready."
            ],
            "links": ["https://rvrjcce.ac.in/training.php?menu=plcmnt"]
        },
        {
            "tag": "placement registration process",
            "patterns": [
                "how do i register for campus placements?",
                "when should i register for placements?",
                "where can i register for placements?"
            ],
            "responses": [
                "Students should register for campus placements in their pre-final year of UG/PG course through MOODLE CMS by providing all the required information within the stipulated period."
            ]
        },
        {
            "tag": "placement communication details",
            "patterns": [
                "what contact details should i provide for placements?",
                "how important are valid phone number and email id for placements?",
                "where can i update my contact details?"
            ],
            "responses": [
                "Giving a valid phone number and email id (that are active) is crucial for corresponding/communicating with the students. Any change in Mobile number or mail id shall be immediately intimated to the T&P CELL."
            ]
        },
        {
            "tag": "placement information",
            "patterns": [
                "how can i stay updated about placement information?",
                "where can i find placement updates?",
                "do you have a platform for placement updates?"
            ],
            "responses": [
                "Students are advised to check mails, college Website News regularly for placement information. They shall also keep in touch with placement volunteers and look at the T&P Cell - Notice Boards located at various places on campus."
            ]
        },
        {
            "tag": "placement eligibility",
            "patterns": [
                "what are the eligibility criteria for placements?",
                "how many backlogs are allowed for placements?",
                "what are the academic requirements for placements?"
            ],
            "responses": [
                "Information regarding Interview Process, Eligibility Criteria - min and maximum no. backlogs and academic break in studies will be available in the circular released by the TPO, T&P Cell, at the time of campus recruitment."
            ]
        },
        {
            "tag": "placement process",
            "patterns": [
                "how does the campus recruitment process work?",
                "what is the procedure for campus placements?",
                "can you explain the placement process?"
            ],
            "responses": [
                "A Company gives information about its visit to a college for a campus drive, at a maximum of 10 days and a minimum of 3 days, in advance. Campus Recruitment Results can be checked on the T&P Cell Notice Boards and the Dept. coordinators."
            ]
        },
        {
            "tag": "placement attendance",
            "patterns": [
                "what are the attendance requirements for placements?",
                "what happens if i miss a placement drive?",
                "is attendance mandatory for placement drives?"
            ],
            "responses": [
                "Students who are eligible for any placement drive will have to give his/her consent before attending the same. Failing which the candidate will be marked absent for the particular drive. Student who fails to attend the placement drive, whether on or off campus subsequent to his/her consent for attending the same will be fined."
            ]
        },
        {
            "tag": "interview preparation",
            "patterns": [
                "how should i prepare for interviews?",
                "what should i bring to interviews?",
                "what is the dress code for interviews?"
            ],
            "responses": [
                "Students should visit the Companyâ€™s website (company profile) before attending the interview. Students should attend the interviews in formal dress, sporting College ID, and bring updated resume, hall ticket/admit card, passport size photographs, and other required documents."
            ]
        },
        {
            "tag": "placement success criteria",
            "patterns": [
                "what is the success criteria for placements?",
                "how are placement results determined?",
                "what happens after i receive an appointment letter?"
            ],
            "responses": [
                "If a student has been selected in the campus interview and has received an appointment letter, then he/she cannot appear again for another interview. Students selected in the campus recruitment are to join the organization on completion of the course."
            ]
        },
        {
            "tag": "placement coordinator contact",
            "patterns": [
                "who should i contact for placement inquiries?",
                "how can i reach the placement coordinators?",
                "what is the contact information for the placement coordinators?"
            ],
            "responses": [
                "All the queries regarding placement drives etc will be addressed by the Placement Co-ordinators. Contact details for the Placement Co-ordinators are provided for students to reach out for placement inquiries."
            ]
        },
        {
            "tag": "housing",
            "patterns": [
                "do you have on-campus housing?",
                "where can i live on campus?"
            ],
            "responses": [
                "Yes, we offer on-campus housing options for students. Our housing facilities provide a comfortable and convenient living environment with various amenities and support services."
            ]
        },
        {
            "tag": "application_process",
            "patterns": [
                "how can i apply?",
                "what is the application process?"
            ],
            "responses": [
                "You can apply online through our website. Make sure to review the application deadlines and requirements for your chosen program. If you have any questions or need assistance with the application process, our admissions team is here to help."
            ]
        },
        {
            "tag": "transfer_credits",
            "patterns": [
                "can i transfer credits from another college?",
                "how can i transfer my credits?"
            ],
            "responses": [
                "Yes, we accept transfer credits from accredited institutions. You will need to submit official transcripts for evaluation. Our admissions office can provide you with more information on the transfer credit policy."
            ]
        },
        {
            "tag": "faculty",
            "patterns": [
                "tell me about the faculty?",
                "who will be teaching the courses?","faculty","faculty qualification"
            ],
            "responses": [
                "Our faculty members are highly qualified and experienced professionals in their respective fields. They are dedicated to providing quality education and mentorship to our students."
            ],
            "links": ["https://rvrjcce.ac.in/departments1.php?menu=stfdir"]
        },
        {
            "tag": "research_opportunities",
            "patterns": [
                "are there research opportunities available?",
                "can i get involved in research projects?"
            ],
            "responses": [
                "Yes, we offer various research opportunities for students across different disciplines. You can collaborate with faculty on research projects, participate in conferences, and publish your work."
            ],
            "links": ["https://rvrjcce.ac.in/res_committee.php?menu=rd"]
        },
        {
            "tag": "student_support_services",
            "patterns": [
                "what student support services do you offer?",
                "is there support available for students?"
            ],
            "responses": [
                "We offer a range of student support services including academic advising, counseling, tutoring, career services, and disability support. Our goal is to ensure that all students have the resources they need to succeed."
            ],
            "links": ["https://rvrjcce.ac.in/res_committee.php?menu=rd"]

        },
        {
            "tag": "clubs_and_organizations",
            "patterns": [
                "what clubs and organizations are available?",
                "how can i get involved in extracurricular activities?","clubs","committees"
            ],
            "responses": [
                "We have a variety of clubs and organizations on campus covering interests such as sports, arts, culture, community service, and more. You can explore these opportunities to connect with peers and pursue your interests outside the classroom."
            ]
        },
        {
            "tag": "health_and_wellness",
            "patterns": [
                "what health and wellness services are available?",
                "is there a health center on campus?","deispencary","medical facilities"
            ],
            "responses": [
                "We have a health center on campus that provides medical care, counseling services, and wellness programs to support the physical and mental well-being of our students."
            ],
            "links": ["https://rvrjcce.ac.in/HealthCommittee.php?menu=comm"]
        },
        {
            "tag": "alumni_network",
            "patterns": [
                "what is the alumni network like?",
                "how can i connect with alumni?","alumni","alumni network"
            ],
            "responses": [
                "Our alumni network is strong and active, with graduates working in various industries and locations worldwide. We offer networking events, mentorship programs, and online platforms to help students connect with alumni for advice and opportunities."
            ],
            "links": ["https://rvrjcce.ac.in/aboutalumni.php?menu=almn"]
        },
        {
            "tag": "safety_and_security",
            "patterns": [
                "how safe is the campus?",
                "what security measures are in place?"
            ],
            "responses": [
                "The safety and security of our students, faculty, and staff are a top priority. We have campus security personnel, emergency response systems, and safety protocols in place to ensure a secure environment."
            ],
            "links": ["https://rvrjcce.ac.in/SafetySecurityMeasures.php?menu=comm"]
        },
        {
            "tag": "events_and_activities",
            "patterns": [
                "what events and activities are happening on campus?",
                "is there anything fun going on?","events","how frequently are events held in rvrjc"
            ],
            "responses": [
                "We host a variety of events and activities throughout the year, including cultural festivals, guest lectures, workshops, performances, and more. These events offer opportunities for learning, networking, and socializing.","The main fest or event that will be held in rvrjc is the college Annual Day and college Fest,which will be held in the month of February."
            ],
            "links": ["https://rvrjcce.ac.in/literary/index.htm"]
        },
        {
            "tag": "Managment",
            "patterns": [
                "who are the founders of rvrjc"
            ],
            "responses": [
                "1.Late Jagarlamudi Chandramouli (1914-1987)",
                "2.Late Dr. K. Sadasiva Rao ",
                "3. Dr. K. Basavapunnaiah - Dr. K. Basavapunnaiah GaruA Founder Member & the present President of Nagarjuna Education Society is a highly respected Physician, associated with Nagarjuna Education Society since its inception in various capacities as Vice-President,",
                "4 Dr. M. Gopalkrishna - Dr. M. Gopala Krishana GaruA Founder Member and the present Secretary of Nagarjuna Education Society and Secretary & Correspondent of R.V.R. & J.C.College of Engineering, Guntur the biggest institute sponsored by Nagarjuna Education Society"
            ]
        },
        {
            "tag": "infrastructure",
            "patterns": [
                "can you tell me about the college's infrastructure?",
                "what facilities does the campus offer?",
                "how is the infrastructure of the college?"
            ],
            "responses": [
                "The college campus boasts well-laid black-topped internal roads with avenue trees, lawns, flower plants, and gardens. It's an environment-friendly campus with abundant greenery, offering a serene and picturesque environment conducive to learning."
            ]
        },
        {
            "tag": "transportation",
            "patterns": [
                "what transportation facilities are available?",
                "how do students commute to campus?",
                "is there a college bus service?","bus facility","transportation"
            ],
            "responses": [
                "We have a fleet of 25 buses exclusively for students and staff, providing a convenient and safe transportation option. This service saves students and staff from the uncertainties of public transport."
            ],
            "links": ["https://rvrjcce.ac.in/transport.php"]
        },
        {
            "tag": "medical facilities",
            "patterns": [
                "are there medical facilities on campus?",
                "is there a dispensary?",
                "what healthcare services are available?"
            ],
            "responses": [
                "We have a dispensary on campus to provide basic medical care and services to students and staff. The health and well-being of our campus community are of utmost importance."
            ]
        },
        {
            "tag": "banking facilities",
            "patterns": [
                "is there a bank on campus?",
                "what banking services are available?",
                "can i access banking facilities easily?","are there banking facilities nearby","are there any banks nearby"
            ],
            "responses": [
                "Yes, we have a bank on campus to cater to the banking needs of students and staff. This convenient facility ensures easy access to banking services without having to leave the campus."
            ]
        },
        {
            "tag": "academic facilities",
            "patterns": [
                "what academic facilities are available?",
                "are there seminar halls?",
                "is there an auditorium for events?"
            ],
            "responses": [
                "We have four air-conditioned seminar halls and an auditorium on campus, along with an open-air theatre. These facilities serve as venues for various co-curricular and extra-curricular events, enriching the college experience."
            ]
        },
        {
            "tag": "environment friendly",
            "patterns": [
                "is the campus environment-friendly?",
                "what sustainability measures are in place?",
                "how green is the campus?"
            ],
            "responses": [
                "Our campus is designed to be environmentally friendly, with green spaces, gardens, and trees contributing to a sustainable and eco-friendly environment. The scenic hills on the western side further enhance the natural beauty of the campus."
            ]
        },
        {
            "tag": "facilities comparison",
            "patterns": [
                "how does the college's infrastructure compare to other institutions?",
                "what makes your infrastructure stand out?",
                "do you provide facilities similar to renowned institutes?"
            ],
            "responses": [
                "Our college infrastructure is built and updated to meet AICTE norms and standards, providing facilities comparable to those of renowned institutes. We strive to offer a comprehensive range of amenities to make life on campus comfortable and enriching."
            ]
        },
        {
            "tag": "wellness centre overview",
            "patterns": [
                "what is the student wellness centre?",
                "can you tell me about the services offered at the wellness centre?",
                "what is the purpose of the wellness centre?"
            ],
            "responses": [
                "The Student Wellness Centre provides counselling services to help students navigate academic, social, emotional, and financial challenges. It aims to support students in managing stress, anxiety, and other concerns that impact their well-being."
            ],
            "links": ["https://rvrjcce.ac.in/studentwellnesscenter/Project-SWC/index.html"]
        },
        {
            "tag": "counselling services",
            "patterns": [
                "what kind of counselling services are available?",
                "how can counselling help students?",
                "what issues can i discuss during counselling?"
            ],
            "responses": [
                "Counselling services address a range of issues such as academic pressures, social and interpersonal concerns, stress, anxiety, and more. Counsellors offer guidance, support, and strategies to help students manage challenges effectively."
            ]
        },
        {
            "tag": "counsellor expertise",
            "patterns": [
                "who are the counsellors at the wellness centre?",
                "what qualifications do the counsellors have?",
                "are the counsellors trained professionals?"
            ],
            "responses": [
                "Wellness and Counselling faculty are trained experts with knowledge of psychology, student behavior, and various challenges students face. They provide empathetic and experienced guidance to help students realize and optimize their full potential."
            ]
        },
        {
            "tag": "wellness center booking session",
            "patterns": [
                "how can i book a counselling session?",
                "what is the process to schedule an appointment?",
                "how long is a counselling session?"
            ],
            "responses": [
                "Students can book a 40-minute slot by contacting the Student Wellness Centre. Sessions are available from Monday to Saturday, from 10 am to 4 pm. It's essential to seek help and address concerns to lead a healthier and happier life."
            ]
        },
        {
            "tag": "wellness center contact details",
            "patterns": [
                "what are the contact details of the wellness centre?",
                "how can i reach the student wellness centre?",
                "is there a phone number or email to contact the wellness centre?"
            ],
            "responses": [
                "You can contact the Student Wellness Centre by calling 9395140868 or emailing wellness@rvrjc.ac.in. Reach out to book a counselling session or inquire about the services offered."
            ]
        },
        {
            "tag": "benefits_of_counselling",
            "patterns": [
                "what are the benefits of counselling?",
                "how can counselling benefit me?",
                "why should i consider counselling?"
            ],
            "responses": [
                "Counselling helps students develop problem-solving skills, manage academic and personal challenges, improve emotional well-being, and enhance overall life satisfaction. It provides a supportive environment to explore concerns, find solutions, and work towards a healthier life."
            ]
        },
        {
            "tag": "confidentiality",
            "patterns": [
                "is counselling confidential?",
                "will my information be kept private?",
                "how secure is the counselling process?"
            ],
            "responses": [
                "Counselling sessions are confidential, and counsellors ensure the privacy and security of students' information. Students can discuss their concerns openly, knowing that their confidentiality will be maintained."
            ]
        },
        {
            "tag": "working hours of wellness center",
            "patterns": [
                "what are the working hours of the wellness centre?",
                "when is the wellness centre open?",
                "is the wellness centre open on weekends?"
            ],
            "responses": [
                "The Student Wellness Centre operates from Monday to Saturday, from 10 am to 4 pm. Students can schedule counselling sessions during these hours to seek guidance and support."
            ]
        },
        {
            "tag": "college hackathon",
            "patterns": [
                "is there a hackathon organized by the college?",
                "does the college host any hackathon events?",
                "how can i participate in the college hackathon?"
            ],
            "responses": [
                "Yes, the college organizes hackathon events to promote innovation and problem-solving among students. Details about upcoming hackathons, registration process, and participation guidelines are typically announced on the college's official website or notice board. Stay tuned for announcements regarding the next hackathon event!"
            ],
            "links": ["https://rvrjcce.ac.in/sih.php"]
        },
        {
            "tag": "nptel overview",
            "patterns": [
                "what is nptel?",
                "can you explain the nptel initiative?",
                "what are the core disciplines covered by nptel?",
                "is the college involved in any government based certification program?"
            ],
            "responses": [
                "NPTEL, the National Programme on Technology Enhanced Learning, was initiated by seven IITs along with the Indian Institute of Science, Bangalore, in 2003. It offers online courses in various disciplines like civil engineering, computer science, electrical engineering, electronics and communication engineering, and mechanical engineering."
            ],
            "links": ["https://rvrjcce.ac.in/nptel_about.php?menu=nptel"]
        },
        {
            "tag": "nptel course format",
            "patterns": [
                "how are the nptel courses structured?",
                "what is the format of nptel courses?",
                "are nptel courses available online?"
            ],
            "responses": [
                "NPTEL offers 4, 8, or 12-week online courses covering topics relevant to students in higher education. These courses are available in web/video format and provide exposure to relevant tools and technologies. The enrolment and learning from these courses are free of cost."
            ]
        },
        {
            "tag": "nptel certification_process",
            "patterns": [
                "how can i obtain a certificate from nptel?",
                "is there a certification exam for nptel courses?",
                "who provides the certification for nptel courses?"
            ],
            "responses": [
                "After completing the online courses, an in-person, proctored certification exam is conducted. Certificates are provided through the participating institutions and industry, when applicable."
            ]
        },
        {
            "tag": "nptel local_chapter_status",
            "patterns": [
                "when did our institution receive the local chapter status for nptel?",
                "is our institution an nptel local chapter?",
                "what is the significance of having a local chapter status?"
            ],
            "responses": [
                "Our institution received the Local Chapter Status for NPTEL in November 2016. Being an NPTEL Local Chapter allows students to benefit from the initiative's resources, courses, and certification exams."
            ]
        },
        {
            "tag": "nptel objectives",
            "patterns": [
                "what are the objectives of nptel?",
                "why was nptel initiated?",
                "what does nptel aim to achieve?"
            ],
            "responses": [
                "The objectives of NPTEL are to enable students to obtain certificates for courses, make them employable in the industry, and encourage them to pursue suitable higher education programmes."
            ]
        },
        {
            "tag": "nptel benefits",
            "patterns": [
                "what are the benefits of enrolling in nptel courses?",
                "how can nptel courses help students?",
                "why should i consider taking nptel courses?"
            ],
            "responses": [
                "NPTEL courses provide students with valuable knowledge and skills in various disciplines, making them more employable and prepared for higher education. They offer a flexible learning environment with free access to high-quality educational resources."
            ]
        },
        {
            "tag": "nptel enrolment_process",
            "patterns": [
                "how can i enrol in nptel courses?",
                "is there a registration process for nptel?",
                "where can i find nptel course offerings?"
            ],
            "responses": [
                "Enrolment in NPTEL courses is typically done through the online portal. Details about course offerings, registration process, and enrolment guidelines are available on the NPTEL official website."
            ]
        },
        {
            "tag": "ieee_student_branch_overview",
            "patterns": [
                "what is the ieee student branch?",
                "can you explain the ieee student branch?",
                "what does the ieee student branch do?"
            ],
            "responses": [
                "The IEEE Student Branch is a student-led organization affiliated with the Institute of Electrical and Electronics Engineers (IEEE). It aims to foster professional development, technical growth, and networking opportunities among students interested in engineering and technology."
            ],
            "links": ["https://rvrjcce.ac.in/IEEE-Student-Branch/index.html"]
        },
        {
            "tag": "ieee membership_benefits",
            "patterns": [
                "what are the benefits of joining the ieee student branch?",
                "why should i become a member of the ieee student branch?",
                "what advantages do ieee student branch members have?"
            ],
            "responses": [
                "Joining the IEEE Student Branch offers numerous benefits, including access to technical resources, workshops, seminars, conferences, networking opportunities, and leadership development programs. It provides a platform to connect with industry professionals and peers, enhancing your professional growth."
            ]
        },
        {
            "tag": "iee activities_and_events",
            "patterns": [
                "what kind of activities and events does the ieee student branch organize?",
                "are there any upcoming events by the ieee student branch?",
                "how can i participate in ieee student branch activities?"
            ],
            "responses": [
                "The IEEE Student Branch organizes various activities and events such as technical workshops, seminars, guest lectures, hackathons, and conferences. Information about upcoming events and participation details are usually shared through the IEEE Student Branch's communication channels."
            ]
        },
        {
            "tag": "ieee leadership_opportunities",
            "patterns": [
                "are there leadership opportunities available in the ieee student branch?",
                "how can i take on a leadership role in the ieee student branch?",
                "what leadership positions are available in the ieee student branch?"
            ],
            "responses": [
                "Yes, the IEEE Student Branch offers leadership opportunities for students to take on roles such as committee members, event organizers, chapter officers, and more. These roles provide valuable experience in leadership, teamwork, and project management."
            ]
        },
        {
            "tag": "ieee collaboration_with_industry",
            "patterns": [
                "does the ieee student branch collaborate with industry professionals?",
                "how does the ieee student branch engage with industry?",
                "are there industry partnerships through the ieee student branch?"
            ],
            "responses": [
                "The IEEE Student Branch often collaborates with industry professionals, organizations, and companies to facilitate workshops, seminars, and networking events. These collaborations provide students with insights into industry trends, opportunities, and potential career paths."
            ]
        },
        {
            "tag": "ieee professional_development",
            "patterns": [
                "how does the ieee student branch support professional development?",
                "are there professional development opportunities through the ieee student branch?",
                "what resources does the ieee student branch offer for career growth?"
            ],
            "responses": [
                "The IEEE Student Branch supports professional development through workshops, seminars, certifications, and mentorship programs. It offers resources and opportunities to enhance technical skills, leadership abilities, and career prospects in the field of engineering and technology."
            ]
        },
        {
            "tag": "ieee membership_registration",
            "patterns": [
                "how can i become a member of the ieee student branch?",
                "is there a registration process for ieee student branch membership?",
                "where can i sign up for ieee student branch membership?"
            ],
            "responses": [
                "You can become a member of the IEEE Student Branch by registering through the IEEE official website or contacting the local chapter at your institution. Membership registration usually requires filling out an online form and paying the applicable membership fee."
            ]
        },
        {
            "tag": "committees_overview",
            "patterns": [
                "what are the various committees in the institution?",
                "can you list the committees and bodies in the institution?",
                "what is the purpose of the committees in the institution?"
            ],
            "responses": [
                "The institution has various committees and bodies responsible for different aspects of governance, academic affairs, student welfare, and more. These committees play a vital role in ensuring smooth functioning and addressing various concerns within the institution."
            ]
        },
        {
            "tag": "specific_committee_function",
            "patterns": [
                "what is the function of the governing body?",
                "what does the academic council do?",
                "can you explain the role of the finance committee?"
            ],
            "responses": [
                "The Governing Body oversees the overall management and governance of the institution. The Academic Council is responsible for academic policies and programs. The Finance Committee manages financial matters, while the Planning & Evaluation Committee focuses on planning and assessing institutional activities."
            ]
        },
        {
            "tag": "committee_membership",
            "patterns": [
                "how are members selected for the committees?",
                "can students participate in the committees?",
                "who are the members of the academic council?"
            ],
            "responses": [
                "Members of the committees are typically appointed based on their expertise, roles, and responsibilities within the institution. Some committees may include student representatives to ensure diverse perspectives and insights."
            ]
        },
        {
            "tag": "committee_meetings",
            "patterns": [
                "how often do the committees meet?",
                "where can i find the minutes of the committee meetings?",
                "is there a schedule for committee meetings?"
            ],
            "responses": [
                "Committees meet periodically as per their scheduled meetings to discuss and address various matters. The minutes of the meetings are usually documented and made available for reference. You can find the schedule and minutes of the committee meetings on the institution's official website or notice board."
            ]
        },
        {
            "tag": "committee_contact",
            "patterns": [
                "how can i contact a specific committee?",
                "is there a contact person for the grievance redressal committee?",
                "where can i direct my concerns to the academic council?"
            ],
            "responses": [
                "You can contact specific committees through their designated contact persons or committee members. Contact details for each committee are typically available on the institution's official website or notice board."
            ]
        },
        {
            "tag": "committee_role",
            "patterns": [
                "what is the role of the student welfare committee?",
                "can you explain the function of the examination committee?",
                "what does the industry institute cell do?"
            ],
            "responses": [
                "The Student Welfare Committee focuses on addressing student-related concerns and promoting student well-being. The Examination Committee oversees examination processes and regulations. The Industry Institute Cell facilitates collaborations and interactions between the institution and industry for mutual benefits."
            ]
        },
        {
            "tag": "committee_policies",
            "patterns": [
                "are there specific policies related to the committees?",
                "where can i find the policies set by the committees?",
                "how are decisions made within the committees?"
            ],
            "responses": [
                "Committees operate based on established policies and guidelines to ensure transparency, fairness, and effectiveness in decision-making. You can find the policies and guidelines set by the committees on the institution's official website or notice board."
            ]
        },
        {
            "tag": "committee_roles_responsibilities",
            "patterns": [
                "what are the roles and responsibilities of the academic audit committee?",
                "can you explain the duties of the grievance redressal committee?",
                "what does the student counselor committee handle?"
            ],
            "responses": [
                "The Academic Audit Committee ensures quality and compliance in academic processes. The Grievance Redressal Committee addresses and resolves grievances raised by students or faculty. The Student Counselor Committee provides guidance and support to students, helping them navigate academic and personal challenges."
            ]
        },
        {
            "tag": "college_details",
            "patterns": [
                "can you provide details about the college?",
                "what is the overview of the college?",
                "where can i find information about the college?"
            ],
            "responses": [
                "The college offers a range of programs and has a dedicated faculty committed to providing quality education. You can find detailed information about the college on its official website, prospectus, or brochure."
            ]
        },
        {
            "tag": "courses_offered",
            "patterns": [
                "what courses are offered by the college?",
                "can you list the courses available at the college?",
                "what are the academic programs provided by the college?"
            ],
            "responses": [
                "The college offers various undergraduate, postgraduate, and diploma courses in different disciplines. Details about the courses, including eligibility criteria, duration, and curriculum, are available on the college's official website or prospectus."
            ],
            "links": ["https://rvrjcce.ac.in/courses.php"]

        },
        {
            "tag": "course_fee",
            "patterns": [
                "what is the fee structure for the courses?",
                "can you provide information about the course fees?",
                "how much does it cost to study at the college?"
            ],
            "responses": [
                "The fee structure for the courses varies depending on the program and duration. You can find detailed information about the course fees, including tuition fees, examination fees, and other charges, on the college's official website or prospectus."
            ],
            "links": ["https://rvrjcce.ac.in/fee.php"]
        },
        {
            "tag": "faculty_details",
            "patterns": [
                "can you provide details about the faculty?",
                "who are the faculty members at the college?",
                "what are the qualifications of the college faculty?","faculty details","faculty qualification"
            
            ],
            "responses": [
                "The college has a team of experienced and qualified faculty members dedicated to delivering quality education. Information about the faculty, including their qualifications, expertise, and research interests, can be found on the college's official website or faculty directory."
            ],
            "links": ["https://rvrjcce.ac.in/departments1.php?menu=stfdir"]
        },
        {
            "tag": "admission_procedure",
            "patterns": [
                "what is the admission procedure?",
                "can you explain the admission process?",
                "how can i apply for admission to the college?"
            ],
            "responses": [
                "The admission procedure involves fulfilling the eligibility criteria, submitting the required documents, and clearing the entrance examination or interview, if applicable. Detailed information about the admission process, including application deadlines, eligibility criteria, and selection criteria, is available on the college's official website or admission brochure."
            ],
            "links": ["https://rvrjcce.ac.in/admissionProcedure.php?menu=col"]
        },
        {
            "tag": "infrastructure_facilities",
            "patterns": [
                "what infrastructure facilities are available at the college?",
                "can you describe the college's infrastructure?",
                "what facilities does the college provide to students?"
            ],
            "responses": [
                "The college provides modern infrastructure facilities, including classrooms, laboratories, libraries, sports facilities, and accommodation options. Details about the infrastructure and facilities available for students can be found on the college's official website or infrastructure section."
            ]
        },
        {
            "tag": "research_activities",
            "patterns": [
                "what research activities are conducted at the college?",
                "can you provide information about the college's research initiatives?",
                "how does the college support research activities?"
            ],
            "responses": [
                "The college encourages research activities across various disciplines and provides resources and support to faculty and students. Information about ongoing research projects, collaborations, and publications can be found on the college's official website or research section."
            ]
        },
        {
            "tag": "phd_enrollments",
            "patterns": [
                "how many ph.d. students are enrolled under the guidance of college faculty?",
                "can you provide details about ph.d. enrollments?",
                "what is the status of ph.d. enrollments at the college?"
            ],
            "responses": [
                "Several Ph.D. students are currently enrolled under the guidance of the college faculty, contributing to research and academic advancements. Detailed information about Ph.D. enrollments, including research areas and faculty mentors, can be found on the college's official website or academic section."
            ]
        },
        {
            "tag": "moodle_elearning_courses",
            "patterns": [
                "what is moodle e-learning?",
                "can you provide information about the moodle e-learning courses?",
                "how can i access moodle e-learning courses?","moodle","rvr moodle"
            ],
            "responses": [
                "MOODLE is an open-source learning platform used by the college to deliver online courses and educational resources. The MOODLE E-Learning courses cover various subjects and are accessible to registered students and faculty members through the college's MOODLE platform.",
                "You can access the college's web services, including MOODLE E-Learning, WebStudio, and the web portal, using your login credentials provided by the college. User guides, tutorials, and support resources for these services are usually available on the respective platforms or IT services section of the college's official website."
            ],
            "links": ["http://courses.rvrjc.ac.in/moodle/"]
        },
        {
            "tag": "web_portal",
            "patterns": [
                "what is the college's web portal?",
                "how can i access the college's web portal?",
                "what services are available on the college's web portal?"
            ],
            "responses": [
                "The college's web portal is a centralized online platform where students, faculty, and staff can access various services and resources, such as academic information, announcements, event details, and more. You can access the web portal using your login credentials provided by the college."
            ]
        },
        {
            "tag": "web_services_support",
            "patterns": [
                "is there support available for using the college's web services?",
                "where can i get help with the college's web services?",
                "how can i troubleshoot issues with the college's web services?",
                "what are the web services provided by the college?",
                "can you explain the college's web services?",
                "where can i find information about the college's web services?",
                "how can i access the college's web services?",
                "is there a user guide for using the college's web services?",
                "where can i find tutorials for the college's web services?"
            ],
            "responses": [
                "Yes, support is available for using the college's web services. You can contact the IT department, helpdesk, or support team for assistance with accessing, using, or troubleshooting issues related to the web services. Contact information and support resources are usually provided on the college's official website.",
                "The college offers various web services to facilitate online learning, communication, and information access for students and faculty. You can find detailed information about the web services on the college's official website or IT services section."
            ]
        }
    ]
}